{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_page_title":false,"heading_align":"text-center"}},"image-banner":{"type":"image-banner","blocks":{"banner-heading-0":{"type":"heading","settings":{"heading":"Help & FAQs","heading_size":"h0","heading_h1":true}},"banner-text-1":{"type":"text","settings":{"text":"<p>Frequently asked questions and answers<\/p>","enlarge_text":true}}},"block_order":["banner-heading-0","banner-text-1"],"settings":{"image_desktop":"shopify:\/\/shop_images\/SAMPLE_NATURAL_20MULTI_5X8_SKU_2062291P1_Scandinavian_20kilim_20_2__GORU00010_02_5c966c4a-c71f-4b5a-afae-db2417a5f282.jpg","image_mobile":"shopify:\/\/shop_images\/VCN-35443_VCRU00002_01_1157e8c8-5ce7-4110-9cc3-82110496b3e1.jpg","url":"","height_mode":"fixed","fixed_height_desktop":400,"fixed_height_mobile":250,"overlay_position":"justify-start items-center","overlay_text_align":"text-start","mob_center_text":true,"mobile_stacked":false,"color_scheme":"white","full_width":true,"transparent_content_color":"#ffffff","tint_color":"#000000","tint_opacity":40,"prevent_animation":false}},"faq_JdN4tH":{"type":"faq","blocks":{"category_TwDh4W":{"type":"category","settings":{"text":"Creating an account on Trampoline"}},"question_ymhWTi":{"type":"question","settings":{"icon":"none","heading":"How do I create an account on Trampoline?","text":"<p>All UK registered retail brands in Home & Living can create a free account on Trampoline. Simply visit the Trampoline Sign-Up page, enter your business contact details including your company name, company email, CRN and VAT numbers and start shopping! <br\/><\/p>"}},"question_aciyWB":{"type":"question","settings":{"icon":"none","heading":"I have not received a verification email. What should I do?","text":"<p>You do not need to verify your email while creating an account with Trampoline. You should be automatically signed in once registered.<\/p>"}},"question_aqPAgF":{"type":"question","settings":{"icon":"none","heading":"Can my brand only have one account on Trampoline?","text":"<p>No, multiple employees responsible for buying and sourcing for your business can create individual accounts on Trampoline. However please note, one-time offers are limited to being availed once per business, brand or company and can not be re-used by individual accounts. <\/p>"}},"category_CYpQeR":{"type":"category","settings":{"text":"Orders and Returns on Trampoline"}},"question_hWMmRC":{"type":"question","settings":{"icon":"none","heading":"What are the minimum order quantities (MOQs) for wholesale purchases?","text":"<p>We want to enable businesses of all scales and sizes to be able to order freely on Trampoline and house a range of exeptional products in their stores. There is no minimum order quantity for Trampoline furniture and mirrors. There is a nominal minimum order quantity of 5 for all our rugs. <\/p>"}},"question_e4qijr":{"type":"question","settings":{"icon":"none","heading":"Does Trampoline have a minimum order value?","text":"<p>Yes, in order to provide you with an exceptional full stack experience, we have a nominal minimum order value of £500 for every order placed on our site.<\/p>"}},"question_DRyyzF":{"type":"question","settings":{"icon":"none","heading":"Can I request a custom order or product customization?","text":"<p>We are currently building this feature for our customers. If you'd like to discuss any customisation requirements, please email us at support@trampoline-store.com.<\/p>"}},"question_MqXGfY":{"type":"question","settings":{"icon":"none","heading":"The item I want is currently out of stock. Could you please help?","text":"<p>Products that are not in stock would be 'Made to Order'and may take between 80-120 days for delivery. The lead time is expressed as a range because it depends on the size of the order and the overall production demand at our factories.<\/p>"}},"question_jt4ibW":{"type":"question","settings":{"icon":"none","heading":"How do I track my order?","text":"<p>You will be sent regular email updates and notifications to help you track your order. If you wish to have more information at any point, please feel free to contact us on support@trampoline-store.com.<\/p>"}},"question_EtCbkJ":{"type":"question","settings":{"icon":"none","heading":"Can I cancel my order?","text":"<p>In-Stock orders can not be cancelled once placed. If your chosen products are made-to-order, the cancellation window is limited to 48 hours from order placement, as it is crafted specifically for you. <\/p>"}},"question_QKHi3n":{"type":"question","settings":{"icon":"none","heading":"Can I return or exchange an item?","text":"<p>We want to make sure our customers enjoy the full stack experience offered by Trampoline, and are happy with every single order they make on our site. In the rare case you aren't satisfied with your order due to a product defect, we’re here to help! You may return orders with product defects in the UK within 30 days from the date of delivery for a refund or a store credit, which will be processed once the items are returned. When sending back items, we request you to kindly include proof of purchase, proof of product defect, and attach the shipping label sent to you via email. Please be aware that for any returns, you would need to be responsible for covering the courier costs. In order to discuss any issues with your order, and to register and process a return, please contact our customer service team at support@trampoline-store.com. <\/p>"}},"category_QBfraP":{"type":"category","settings":{"text":"Shipping on Trampoline"}},"question_L4KqqF":{"type":"question","settings":{"icon":"none","heading":"Which areas\/countries do you ship to?","text":"<p>At the moment, we only ship to the UK but we have exciting plans to come to the US and the EU very soon! Please feel free to reach out to support@trampoline-store.com for any bespoke requirements.<\/p>"}},"question_3KB3CQ":{"type":"question","settings":{"icon":"none","heading":"What modes of shipping do you use?","text":"<p>We are very conscious of our environment and are sustainability driven in all that we do. We ship via Ocean freight and may use air freight only in rare occasions.<\/p>"}},"question_7FdExb":{"type":"question","settings":{"icon":"none","heading":"How long will it take for you to ship my order?","text":"<p>We are committed to providing you with an exceptional shopping experience with full transparency and clarity. For products that are ‘Made to Order’, your order will be delivered within 80-120 days of placing it. The lead time is expressed as a range because it depends on the size of the order and the overall production demand at our factories. All 'In Stock' items will be delivered within 7 business days. Trampoline manages the entire process from order to delivery, and all costs associated with shipping are covered by us. We will keep you regularly updated on the status of your order, all the way from production, QC and shipment to doorstep delivery! <br\/>For any questions on shipping & delivery please contact our customer service at support@trampoline-store.com.<br\/><\/p>"}},"question_9VzPYR":{"type":"question","settings":{"icon":"none","heading":"Which shipping partners do you use?","text":"<p>We have multiple shipping partners that we tap into depending on the order. We are commited to always delivering as per promised timelines.<\/p>"}},"question_dW7VFC":{"type":"question","settings":{"icon":"none","heading":"How are shipping costs calculated?","text":"<p>Trampoline manages end to end logistics and all prices you see on our website are inclusive of shipping. You will not be charged any additional shipping fee.<\/p>"}},"category_9VpcMD":{"type":"category","settings":{"text":"Payments on Trampoline"}},"question_eeF7YT":{"type":"question","settings":{"icon":"none","heading":"Is it safe to make payments on Trampoline’s website?","text":"<p>All transactions made on our website are entirely safe and offer full customer data protection . From a technological standpoint, we follow GDPR guidelines, the EU General Data Protection Regulation that started on May 25, 2018, replacing the Data Protection Directive 95\/46\/EC. This ensures the protection of user data. When it comes to payments, we only partner with trusted global payment services like PayPal, Visa, and Mastercard.<\/p>"}},"question_pfmUr9":{"type":"question","settings":{"icon":"none","heading":"Which payment methods do you accept?","text":"<p>We offer our customers a 30 day credit period from the date of order delivery. This means you can receive your products and still have 30 days to complete the full payment via bank transfer, no advance needed. You will receive your final tax invoice with bank transfer details once orders are dispatched. <\/p><p>Should you wish to pay at the time of placing an order itself, you are free to do so by selecting Credit Cards as an option at check out. We accept Visa and Mastercard. <\/p>"}},"question_ePAp7w":{"type":"question","settings":{"icon":"none","heading":"The payment for my order didn’t go through. What should I do?","text":"<p>This is only applicable if you have chosen Credit Card as your mode of payment at check out vs. Payment on Delivery. <\/p><p>Visit the 'My Orders' section under your Trampoline Account page to see the order for which your payment may have failed. Against the order, you will have an option to Retry Payment. If the issue persists, please contact our customer service at support@trampoline-store.com.<\/p>"}},"question_j6VB3D":{"type":"question","settings":{"icon":"none","heading":"My payment was deducted but I didn’t get any order confirmation email. What should I do?","text":"<p>While this is highly unlikely to happen, please go to the 'My Order' section under your Trampoline Account page to check if you see your order. If you do, then your order has been registered and you should receive a confirmation email shortly. If you do not see your order, please contact our customer service at support@trampoline-store.com.<\/p>"}},"category_ngBa8c":{"type":"category","settings":{"text":"More"}},"question_m6Y6Pq":{"type":"question","settings":{"icon":"none","heading":"Need more help?","text":"<p>We’re committed to making our customers happy. If your question or concern goes beyond what is addressed in our FAQs, please feel free to email us at support@trampoline-store.com and we will aim to get back to you within 2-3 business days.<\/p>"}}},"block_order":["category_TwDh4W","question_ymhWTi","question_aciyWB","question_aqPAgF","category_CYpQeR","question_hWMmRC","question_e4qijr","question_DRyyzF","question_MqXGfY","question_jt4ibW","question_EtCbkJ","question_QKHi3n","category_QBfraP","question_L4KqqF","question_3KB3CQ","question_7FdExb","question_9VzPYR","question_dW7VFC","category_9VpcMD","question_eeF7YT","question_pfmUr9","question_ePAp7w","question_j6VB3D","category_ngBa8c","question_m6Y6Pq"],"settings":{"heading":"","heading_align":"text-center","color_scheme":"1","full_width":true}},"contact-form":{"type":"contact-form","blocks":{"contact-text-1":{"type":"text","settings":{"text":"<p>If the answers you're looking for aren't in our FAQ, please send us an email by completing the form below.<\/p>","half_width":false}},"contact-name-2":{"type":"name","settings":{"required":true,"half_width":true}},"contact-email-3":{"type":"email","settings":{"required":true,"half_width":true}},"contact-dropdown-4":{"type":"dropdown","settings":{"title":"How can we help?","options":"Placing an Order\nDeliveries \nOther","half_width":false}},"contact-body-5":{"type":"body","settings":{"required":true,"half_width":false}}},"block_order":["contact-text-1","contact-name-2","contact-email-3","contact-dropdown-4","contact-body-5"],"settings":{"heading":"Still looking for answers?","heading_align":"text-center","image_position":"top","color_scheme":"1","full_width":false,"button_style":"btn btn--primary"}},"featured-collection":{"type":"featured-collection","settings":{"title":"Trending","heading_align":"text-start","show_view_all":true,"collection":"all-furnitures","layout":"carousel","card_size_mobile":"small","card_size":"small","products_to_show":24,"show_promo_info":false,"image_ratio":"1","promo_title":"A headline to grab attention","content":"<p>Use this card with an image to highlight your collections or introduce a promotion.<\/p>","link_url":"","button_label":"Button","color_scheme":"none","button_style":"btn btn--secondary"}},"newsletter":{"type":"newsletter","blocks":{"newsletter-heading-1":{"type":"heading","settings":{"heading":"Sign up to our Newsletter","heading_size":"h5"}},"newsletter-text-2":{"type":"text","settings":{"text":"<p>Be the first to know about new collections and exclusive offers.<\/p>","enlarge_text":false}},"newsletter-form-3":{"type":"form","settings":{}}},"block_order":["newsletter-heading-1","newsletter-text-2","newsletter-form-3"],"disabled":true,"settings":{"overlay_position":"justify-center","text_align":"text-center","color_scheme":"default","full_width":true,"transparent_content_color":"#ffffff","tint_color":"#000000","tint_opacity":20}}},"order":["main","image-banner","faq_JdN4tH","contact-form","featured-collection","newsletter"]}